## Overview

One of the cornerstones of Exploratory Data Analysis (EDA) is being able to identify variable types such as categorical, quantitative, continuous, discrete, ordinal, nominal and identifier.  We will need different statistical methods to display and describe each of these different types of data.

## Follow Along

First, data can most easily be classified as categorical or quantitative.

- Categorical data places each observation into one and only one category: hair color, eye color, favorite flavor of ice cream, letter grade in a class, zip code

- Quantitative data measures something: height, weight, income, number of children

Categorical data can further be classified as ordinal, nominal or an identifier variable.
- Nominal data has no natural ordering: hair color, eye color
- Oridnal data has a natural ordering: letter grades - A, B, C, D, F
- Identifier variables identify each record uniquely and are not analyzed

Quantitative data can further be classified as discrete or continuous.
- Discrete data can be counted in a finite amount of time: Number of individuals riding on a bus
- Continuous data can be measured ever more precisely: My age is 38.334283948577 years old.

#### Let's import the Titanic.csv dataset and identify the different variable types:

Run the code block below to import and print the top 5 observations from the Titanic dataset.  We'll cover exactly how this works in today's Guided Project.

Then take a look at the Titanic Data Dictionary linked below.

In [2]:
import pandas as pd

data_url = 'https://raw.githubusercontent.com/LambdaSchool/data-science-practice-datasets/main/unit_1/Titanic/Titanic.csv'

df = pd.read_csv(data_url, skipinitialspace=True, header=0)

print(df.shape)
df.head()
df.describe()

(887, 8)

         Survived      Pclass  ...  Parents/Children_Aboard       Fare
count  887.000000  887.000000  ...               887.000000  887.00000
mean     0.385569    2.305524  ...                 0.383315   32.30542
std      0.487004    0.836662  ...                 0.807466   49.78204
min      0.000000    1.000000  ...                 0.000000    0.00000
25%      0.000000    2.000000  ...                 0.000000    7.92500
50%      0.000000    3.000000  ...                 0.000000   14.45420
75%      1.000000    3.000000  ...                 0.000000   31.13750
max      1.000000    3.000000  ...                 6.000000  512.32920

[8 rows x 6 columns]

[Titanic Data Dictionary](https://github.com/LambdaSchool/data-science-practice-datasets/tree/main/unit_1/Titanic)

###Use the resources above to answer the following questions about the Titanic dataset:



1. Which variable is the identifier variable?

Answer:


2. Which variables are categorical?  Are they ordinal or nominal?

Answer:


3. Which variables are quantiative?  Are they quantitative or discrete?

Answer: